filestore/onejob-3drives-lxd/rw-1M.out
ceph-fuse: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
fio-2.16
Starting 1 process

ceph-fuse: (groupid=0, jobs=1): err= 0: pid=1505: Wed Feb 28 00:09:01 2018
  read : io=1365.0MB, bw=23287KB/s, iops=22, runt= 60023msec
    slat (usec): min=5906, max=11632, avg=9120.59, stdev=647.77
    clat (msec): min=48, max=1246, avg=681.93, stdev=125.55
     lat (msec): min=57, max=1253, avg=691.05, stdev=125.51
    clat percentiles (msec):
     |  1.00th=[  445],  5.00th=[  494], 10.00th=[  537], 20.00th=[  586],
     | 30.00th=[  619], 40.00th=[  644], 50.00th=[  676], 60.00th=[  701],
     | 70.00th=[  742], 80.00th=[  775], 90.00th=[  840], 95.00th=[  889],
     | 99.00th=[ 1020], 99.50th=[ 1123], 99.90th=[ 1221], 99.95th=[ 1254],
     | 99.99th=[ 1254]
    bw (KB  /s): min= 4096, max=49152, per=100.00%, avg=23599.04, stdev=9589.12
  write: io=1356.0MB, bw=23134KB/s, iops=22, runt= 60023msec
    slat (msec): min=19, max=358, avg=35.05, stdev=32.59
    clat (usec): min=14, max=1228.4K, avg=675501.41, stdev=123496.84
     lat (msec): min=23, max=1255, avg=710.55, stdev=125.38
    clat percentiles (msec):
     |  1.00th=[  441],  5.00th=[  498], 10.00th=[  529], 20.00th=[  570],
     | 30.00th=[  611], 40.00th=[  635], 50.00th=[  668], 60.00th=[  701],
     | 70.00th=[  734], 80.00th=[  775], 90.00th=[  832], 95.00th=[  881],
     | 99.00th=[ 1037], 99.50th=[ 1074], 99.90th=[ 1205], 99.95th=[ 1221],
     | 99.99th=[ 1221]
    bw (KB  /s): min= 4096, max=57344, per=100.00%, avg=23576.50, stdev=9502.97
    lat (usec) : 20=0.04%
    lat (msec) : 50=0.07%, 100=0.11%, 500=5.15%, 750=67.99%, 1000=25.51%
    lat (msec) : 2000=1.14%
  cpu          : usr=0.54%, sys=2.44%, ctx=23144, majf=0, minf=589
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=0.6%, 32=98.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=1365/w=1356/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=1365.0MB, aggrb=23287KB/s, minb=23287KB/s, maxb=23287KB/s, mint=60023msec, maxt=60023msec
  WRITE: io=1356.0MB, aggrb=23133KB/s, minb=23133KB/s, maxb=23133KB/s, mint=60023msec, maxt=60023msec