filestore/onejob-3drives-lxd/write-1M.out
ceph-fuse: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
fio-2.16
Starting 1 process

ceph-fuse: (groupid=0, jobs=1): err= 0: pid=1385: Wed Feb 28 00:04:59 2018
  write: io=1740.0MB, bw=29691KB/s, iops=28, runt= 60011msec
    slat (msec): min=20, max=302, avg=34.47, stdev=28.90
    clat (usec): min=13, max=1565.5K, avg=1055990.06, stdev=135971.84
     lat (msec): min=26, max=1589, avg=1090.46, stdev=136.12
    clat percentiles (msec):
     |  1.00th=[  693],  5.00th=[  889], 10.00th=[  930], 20.00th=[  971],
     | 30.00th=[  996], 40.00th=[ 1029], 50.00th=[ 1045], 60.00th=[ 1074],
     | 70.00th=[ 1106], 80.00th=[ 1156], 90.00th=[ 1205], 95.00th=[ 1254],
     | 99.00th=[ 1434], 99.50th=[ 1467], 99.90th=[ 1565], 99.95th=[ 1565],
     | 99.99th=[ 1565]
    bw (KB  /s): min= 4096, max=45056, per=100.00%, avg=29893.59, stdev=8080.54
    lat (usec) : 20=0.06%
    lat (msec) : 50=0.06%, 100=0.11%, 250=0.17%, 500=0.17%, 750=0.57%
    lat (msec) : 1000=29.25%, 2000=69.60%
  cpu          : usr=0.62%, sys=1.49%, ctx=15679, majf=0, minf=584
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.5%, 16=0.9%, 32=98.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1740/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=1740.0MB, aggrb=29690KB/s, minb=29690KB/s, maxb=29690KB/s, mint=60011msec, maxt=60011msec